lexicon = {'start': 'Привет! 👋\n\nДобро пожаловать! Чтобы получить доступ'
                    ' к закрытому каналу, нужно оплатить подписку. '
                    'После оплаты просто нажмите кнопку <b>Проверить оплату ✅</b>'
                    ' и доступ будет предоставлен автоматически.'
                    ' Подписка действует <b>ежемесячно</b> поэтому для продления '
                    'доступа в следующем месяце вам также '
                    'нужно будет повторить оплату.\n\nСпасибо, что с нами! Если '
                    'возникнут вопросы, мы всегда готовы помочь.',
           'every_buy': 'Привет! 👋\n\nРады видеть вас снова! Чтобы продлить доступ к закрытому каналу, нужно '
                        'оплатить подписку на текущий месяц. После оплаты просто нажмите кнопку <b>Проверить '
                        'оплату ✅</b>, и доступ будет обновлен автоматически.\n\n'
                        'Спасибо, что остаетесь с нами! Если возникнут вопросы, мы всегда готовы помочь.',
           'buy': 'Отлично! 🎉 Вы успешно оплатили доступ! Спасибо, что с нами! '
                  'Вот ваша ссылка на закрытый канал: https://t.me/+ntLkDcO6lCU4Nzli. Добро пожаловать! 💬\n'
                  'Ваша подписка активирована с {start_date} и действует до {end_date}.\n\n'
                  'За 3 дня до окончания подписки мы напомним вам о необходимости продления. '
                  'В случае не оплаты, вы будете удалены из канала.',
           'already_buy': 'Спасибо за оплату! 🎉 Вот ваша ссылка - https://t.me/+ntLkDcO6lCU4Nzli на канал. Пожалуйста, помните, что следующая оплата '
                          'потребуется через месяц, чтобы сохранить доступ.',
           'end_sub': "⚠️ Внимание! Ваша подписка закончится через 3 дня.\n"
                      "Пожалуйста, возобновите свою подписку, чтобы продолжить пользоваться всеми нашими сервисами. "
                      "В противном случае, вы будете удалены из канала.\n\n"
                      "Для продления подписки, пожалуйста, следуйте инструкциям, приведенным ниже:\n"
                      "1. Нажать на кнопку <b>Оплатить 💳</b>.\n"
                      "2. Нажать на кнопку <b>Проверка оплаты ✅</b>",
           'del_user': "❌ Ваш доступ к каналу был прекращен из-за неоплаты подписки.\n"
                "К сожалению, срок вашей подписки истек, и вы не продлили её вовремя.\n\n"
                "Если вы хотите восстановить доступ, пожалуйста, следуйте инструкциям по продлению подписки:\n"
                "1. Нажать на кнопку <b>Оплатить 💳</b>.\n"
                "2. Нажать на кнопку <b>Проверка оплаты ✅</b>",
           'new_user': '📢 Новая регистрация пользователя!\n'
                '👤 Имя пользователя: {user_full_name}\n'
                '\n\n'
                'Пользователь успешно оформил подписку и зарегистрировался в системе.',

}